cask_args appdir: '/Applications'

# Essential tools
brew 'git'
brew 'stow'
brew 'bash'

# Development tools
brew 'node'
brew 'python'
brew 'go'
brew 'rust'
brew 'java'
brew 'libpq' # PostgreSQL client libraries
brew 'putty' # SSH client

# Containers and virtualization
brew 'docker'
brew 'docker-compose'

# Utilities
brew 'htop'
brew 'ffmpeg'
brew 'fastfetch'

# Applications / Casks
cask 'visual-studio-code' # Code editor
cask 'iterm2' # Terminal emulator
cask 'spotify' # Music streaming
cask 'docker' # Containerization platform
cask 'wireshark' # Network protocol analyzer
cask 'prismlauncher' # Minecraft launcher
cask 'gyazo' # Screenshot tool
